app/controllers/permit_steps_controller.rb

  def update
    @permit = current_permit

    # checks if permit is done so model knows when to do validation
    params[:permit][:status] = step.to_s
    params[:permit][:status] = 'active' if step == steps.last

    case step

    when :answer_screener

      params[:permit][:owner_address] = full_address(params[:permit][:owner_address])
      @permit.update_attributes(permit_params)
---
UPDATE "permits" SET "ac" = $1, "agent_name" = $2, "contact_id" = $3, "contractor_id" = $4, "contractor_name" = $5, "email" = $6, "fax" = $7, "license_holder" = $8, "license_num" = $9, "other_contact_id" = $10, "owner_name" = $11, "phone" = $12, "updated_at" = $13, "work_summary" = $14 WHERE "permits"."id" = 2