app/controllers/permits_controller.rb

INSERT INTO "permits" ("addition", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["addition", "t"], ["created_at", "2014-05-19 18:01:27.112171"], ["updated_at", "2014-05-19 18:01:27.112171"]]
---
  def create
    puts "========in permit_create: full path: #{request.fullpath}"
    @permit = Permit.new(permit_params)
    if @permit.save